{
  "section01": {
    "img": ["images/landing/IMG_7604.jpeg"],
    "title": "Who I am?",
    "miniTitle": ["Why did you become a front-end developer?", "Afterwards..."],
    "content": [
      "As I came across Facebook, where individuals produce content and communicate in both directions while using web services, and services that are more comfortable than existing logins such as social logins, I became interested in this field, and learned state-funded Java Spring FullStec as my first coding. When I first encountered web development, I felt that the front end that gives users a direct experience depending on how I write the code was right for me.",
      "After graduation, after deciding to become a front-end developer, I completed a 12-week front-end boot camp code camp using the latest technology stack, including React Hooks. (2022. 03. 14 ~ 2022. 06. 03)",
      "After completion, I am in charge of the front-end of the 'Papaya Play' platform at a company called VertigoGames."
    ],
    "highlight": [
      "I'm Joonyoung Cho, a front-end developer who writes code from the user's point of view!"
    ]
  },
  "section02": {
    "one": {
      "title": "I'm a communicating developer",
      "content": "I think communication is one of the important factors for developers. As I took the boot camp, I worked on the last team project with the backend and designer. When the first result came out, there was a difference of opinion because each person had a different direction of thinking. In that situation, I felt the importance of communication in collaborating. After that, we had regular meetings to communicate our opinions and compromise on the project's amendments, and to share our work lists and issues that occurred while working. Thanks to the previous efforts, there was no big problem due to differences in opinions while working on the team project after that."
    },
    "two": {
      "title": "I want to give users a more comfortable experience",
      "contentOne": "From the user's point of view each time you write a code? I'm always thinking of that.",
      "contentTwo": "While working on the team project, various functions were good, but I tried to approach them in detail in the internal process. I thought a lot about which page to route the text to, whether it is more cumbersome for the user to take the next action, step up the membership authentication method, and where to place the translating button and translation text to fit with the existing text and read it comfortably. After presenting to the next code camp rider, he received good reviews for his convenience and neat design in the part he received feedback."
    },
    "three": {
      "title": "Not satisfied with the current state",
      "contentOne": "As I said earlier, if there is a good evaluation of team project feedback, there is also a criticism. I can say that I am not satisfied with the status quo.",
      "contentTwo": "Based on the feedback, we conducted a refactoring of each function. At the time of the project planning, mobile was not considered due to time problems, so I received a lot of criticism. I can't satisfy all 100 people out of 100, but I don't think we should be satisfied with the status quo. We received feedback that the screen on mobile and the search window did not follow during scrolling, so we proceeded with refactoring as much as possible. It also went through some modifications to give a more unified sense of design.",
      "contentThree": "Since I got a job, I am still trying to study personally and record it on my blog. For the previous reason, I created the current page to use various technologies."
    }
  },
  "photo": {
    "profileInfo": {
      "mail": "aimzero9303@gmail.com",
      "blog": "https://velog.io/@aimzero9303",
      "github": "https://github.com/EngChooN",
      "instagram": "https://www.instagram.com/j00n0__/"
    }
  }
}
