{
  "section01": {
    "img": ["images/landing/IMG_7604.jpeg"],
    "title": "Who I am?",
    "miniTitle": ["Why did you become a front-end developer?", "Afterwards..."],
    "content": [
      "As I came across Facebook, where individuals produce content and communicate in both directions while using web services, and services that are more comfortable than existing logins such as social logins, I became interested in this field, and learned state-funded Java Spring FullStec as my first coding. When I first encountered web development, I felt that the front end that gives users a direct experience depending on how I write the code was right for me.",
      "After graduation, after deciding to become a front-end developer, I completed a 12-week front-end boot camp code camp using the latest technology stack, including React Hooks. (2022. 03. 14 ~ 2022. 06. 03)",
      "After completion, I am in charge of the front-end of the 'Papaya Play' platform at a company called VertigoGames."
    ],
    "highlight": [
      "I'm Joonyoung Cho, a front-end developer who writes code from the user's point of view!"
    ]
  },
  "section02": {
    "title": "A memorable recent event",
    "img01": {
      "src": "images/landing/IMG_7603.mov",
      "place": "My birthday party in Gapyeong",
      "desc": "I rode luge with my friends on a trip to Ganghwado.",
      "date": "2022.07.22 ~ 2022.07.23"
    }
  },
  "section03": {
    "title": "Page Development News",
    "miniTitle": "You can see the history and changes to this page in Section Three.",
    "log": [
      {
        "date": "2023.02.24",
        "desc": "(NOTICE) Hello, everyone.",
        "content": "The project that started on 2023-02-02 is finally available! It's still under development, but it's constantly under development and distribution at the same time. I look forward to your feedback.",
        "img": "https://gw.alipayobjects.com/zos/rmsportal/mqaQswcyDLcXyDKnZfES.png"
      }
    ]
  },
  "languageButton": {
    "lang01": "english",
    "lang02": "korean"
  },
  "photo": {
    "profileInfo": {
      "mail": "aimzero9303@gmail.com",
      "blog": "https://velog.io/@aimzero9303",
      "github": "https://github.com/EngChooN",
      "instagram": "https://www.instagram.com/j00n0__/"
    }
  }
}
