{
  "section01": {
    "img": ["images/landing/IMG_7604.jpeg"],
    "title": "Who I am?",
    "miniTitle": ["Why did you become a front-end developer?", "Afterwards..."],
    "content": [
      "As I came across Facebook, where individuals produce content and communicate in both directions while using web services, and services that are more comfortable than existing logins such as social logins, I became interested in this field, and learned state-funded Java Spring FullStec as my first coding. When I first encountered web development, I felt that the front end that gives users a direct experience depending on how I write the code was right for me.",
      "After graduation, after deciding to become a front-end developer, I completed a 12-week front-end boot camp code camp using the latest technology stack, including React Hooks. (2022. 03. 14 ~ 2022. 06. 03)",
      "During the boot camp, the pair was randomly changed every week and a week of evaluation was given by pair. In that area, most of the evaluation was positive in communication and evaluation that the code was creative.",
      "After completion, I am in charge of the front-end of the 'Papaya Play' platform at a company called VertigoGames."
    ],
    "highlight": [
      "I'm Joonyoung Cho, a front-end developer who writes code from the user's point of view!"
    ]
  },
  "section02": {
    "one": {
      "title": "I'm a communicating developer",
      "content": "I think communication is one of the important factors for developers. As I took the boot camp, I worked on the last team project with the backend and designer. When the first result came out, there was a difference of opinion because each person had a different direction of thinking. In that situation, I felt the importance of communication in collaborating. After that, we had regular meetings to communicate our opinions and compromise on the project's amendments, and to share our work lists and issues that occurred while working. Thanks to the previous efforts, there was no big problem due to differences in opinions while working on the team project after that."
    },
    "two": {
      "title": "I want to grow up like this",
      "content": "I want to be a developer who can develop into a better code with the question 'Why' every time I make the code. I want to develop a mindset that values the user experience and the ability to write maintenance code. I want to be a colleague who wants to work together in an attitude that can gain trust from colleagues without losing a sense of challenge and curiosity about new things."
    },
    "three": {
      "title": "I want to give users a more comfortable experience",
      "contentOne": "From the user's point of view each time you write a code? I'm always thinking of that.",
      "contentTwo": "While working on the team project, various functions were good, but I tried to approach them in detail in the internal process. I thought a lot about which page to route the text to, whether it is more cumbersome for the user to take the next action, step up the membership authentication method, and where to place the translating button and translation text to fit with the existing text and read it comfortably. After presenting to the next code camp rider, he received good reviews for his convenience and neat design in the part he received feedback."
    },
    "four": {
      "title": "Not satisfied with the current state",
      "contentOne": "As I said earlier, if there is a good evaluation of team project feedback, there is also a criticism. I can say that I am not satisfied with the status quo.",
      "contentTwo": "Based on the feedback, we conducted a refactoring of each function. At the time of the project planning, mobile was not considered due to time problems, so I received a lot of criticism. I can't satisfy all 100 people out of 100, but I don't think we should be satisfied with the status quo. We received feedback that the screen on mobile and the search window did not follow during scrolling, so we proceeded with refactoring as much as possible. It also went through some modifications to give a more unified sense of design.",
      "contentThree": "Since I got a job, I am still trying to study personally and record it on my blog. For the previous reason, I created the current page to use various technologies."
    },
    "five": {
      "title": "I am a developer who does my best to the end even if there is a problem",
      "contentOne": "I can say that I am a developer who continues to confront any problems rather than giving up.",
      "contentTwo": "At the time of the team project, we had to implement the chat using socket.io. With three days left until the announcement, socket.io was the first, and I saw a source made with code other than React for the first time, so two days have passed without understanding at all. But on the last day, I kept trying to analyze the source, and maybe because I was googling and trying to analyze it, the codes started to get understood. Thanks to this, I have an experience of successfully implementing the chat function before the presentation. I agree with the saying that skill is the sum of pain. Even if it's hard in the process of solving a problem, I think it will soon become my ability if I have to face it to the end and solve it at the end."
    }
  },
  "pfReview": [
    {
      "one": {
        "titleOne": "우** PF-Review 🙋🏻‍♂️",
        "titleTwo": "🎙 Communication Assessment",
        "contentOne": "When communicating, you seem to be properly aware of the other person or your problems and situations. When I ask Cho Joon-young a question, or Cho Joon-young asks me a question, I think he's good at pinpointing the point of the question. And I think you have a good attitude of sympathy, consideration, and manners for the other person's feelings.",
        "titleThree": "👍🏻 The good part",
        "contentTwo": "He has the ability to pinpoint what he doesn't know, ask questions, and get the gist of the other person's questions well. - Another PF had difficulties in the learning process from the first day, and it was impressive to see him helping a lot.",
        "titleFour": "🤔 Areas of improvement",
        "contentThree": "During the short period of a week, there were more advantages than disadvantages, so there was nothing to improve."
      }
    },
    {
      "one": {
        "titleOne": "우** 님의 PF-Review 🙋🏻‍♂️",
        "titleTwo": "🎙 Communication Assessment",
        "contentOne": "When communicating, you seem to be properly aware of the other person or your problems and situations. When I ask Cho Joon-young a question, or Cho Joon-young asks me a question, I think he's good at pinpointing the point of the question. And I think you have a good attitude of sympathy, consideration, and manners for the other person's feelings.",
        "titleThree": "👍🏻 The good part",
        "contentTwo": "He has the ability to pinpoint what he doesn't know, ask questions, and get the gist of the other person's questions well. - Another PF had difficulties in the learning process from the first day, and it was impressive to see him helping a lot.",
        "titleFour": "🤔 Areas of improvement",
        "contentThree": "During the short period of a week, there were more advantages than disadvantages, so there was nothing to improve."
      }
    },
    {
      "one": {
        "titleOne": "우** 님의 PF-Review 🙋🏻‍♂️",
        "titleTwo": "🎙 Communication Assessment",
        "contentOne": "When communicating, you seem to be properly aware of the other person or your problems and situations. When I ask Cho Joon-young a question, or Cho Joon-young asks me a question, I think he's good at pinpointing the point of the question. And I think you have a good attitude of sympathy, consideration, and manners for the other person's feelings.",
        "titleThree": "👍🏻 The good part",
        "contentTwo": "He has the ability to pinpoint what he doesn't know, ask questions, and get the gist of the other person's questions well. - Another PF had difficulties in the learning process from the first day, and it was impressive to see him helping a lot.",
        "titleFour": "🤔 Areas of improvement",
        "contentThree": "During the short period of a week, there were more advantages than disadvantages, so there was nothing to improve."
      }
    },
    {
      "one": {
        "titleOne": "우** 님의 PF-Review 🙋🏻‍♂️",
        "titleTwo": "🎙 Communication Assessment",
        "contentOne": "When communicating, you seem to be properly aware of the other person or your problems and situations. When I ask Cho Joon-young a question, or Cho Joon-young asks me a question, I think he's good at pinpointing the point of the question. And I think you have a good attitude of sympathy, consideration, and manners for the other person's feelings.",
        "titleThree": "👍🏻 The good part",
        "contentTwo": "He has the ability to pinpoint what he doesn't know, ask questions, and get the gist of the other person's questions well. - Another PF had difficulties in the learning process from the first day, and it was impressive to see him helping a lot.",
        "titleFour": "🤔 Areas of improvement",
        "contentThree": "During the short period of a week, there were more advantages than disadvantages, so there was nothing to improve."
      }
    }
  ],
  "photo": {
    "profileInfo": {
      "mail": "aimzero9303@gmail.com",
      "blog": "https://velog.io/@aimzero9303",
      "github": "https://github.com/EngChooN",
      "instagram": "https://www.instagram.com/j00n0__/"
    }
  }
}
